<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\MainCategory;
use App\Models\SubCategory;

class CategorySeeder extends Seeder
{
    public function run()
    {
        // หมวดงานซ่อมหลักและย่อย
        $categories = [
            'เครื่องปรับอากาศ (แอร์)' => ['ไม่เย็น', 'รั่วซึม', 'เสียงดัง'],
            'เครื่องทำน้ำอุ่น' => ['ไม่ทำงาน', 'รั่วซึม', 'น้ำไม่ร้อน'],
            'ไฟฟ้าและหลอดไฟ' => ['หลอดไฟเสีย', 'สวิตช์ไฟไม่ทำงาน', 'ปลั๊กไฟหลวม'],
            'ประตูและหน้าต่าง' => ['ลูกบิดประตูเสีย', 'ประตูหรือหน้าต่างปิดไม่สนิท', 'บานพับชำรุด'],
            'เฟอร์นิเจอร์' => ['โต๊ะชำรุดหรือเสียหาย', 'เก้าอี้ชำรุดหรือเสียหาย', 'ตู้เสื้อผ้าชำรุดหรือเสียหาย'],
            'ระบบประปา' => ['ท่อน้ำรั่ว', 'น้ำไม่ไหล', 'ก๊อกน้ำหรือสายชำระเสีย'],
            'ห้องน้ำ' => ['ชักโครกเสีย', 'อ่างล้างหน้าอุดตัน', 'ระบายน้ำช้า'],
            'เครื่องซักผ้า (ถ้ามีในห้อง)' => ['เครื่องไม่ทำงาน', 'ปั่นไม่หมาด'],
            'ผนังและพื้นห้อง' => ['ผนังร้าว', 'พื้นเสียหายหรือหลุดร่อน'],
            'อินเทอร์เน็ตและโทรทัศน์' => ['อินเทอร์เน็ตไม่เชื่อมต่อ', 'โทรทัศน์สัญญาณขัดข้อง']
        ];

        foreach ($categories as $mainCategory => $subCategories) {
            // สร้างหมวดงานซ่อมหลัก
            $mainCategoryModel = MainCategory::create(['name' => $mainCategory]);

            // สร้างหมวดงานซ่อมย่อยที่สัมพันธ์กับหมวดงานซ่อมหลัก
            foreach ($subCategories as $subCategory) {
                SubCategory::create([
                    'name' => $subCategory,
                    'main_category_id' => $mainCategoryModel->id
                ]);
            }
        }
    }
}
